
import streamlit as st
import pandas as pd
import requests
from bs4 import BeautifulSoup
import re
from wordcloud import WordCloud, STOPWORDS
import matplotlib.pyplot as plt
from pythainlp import sent_tokenize, word_tokenize
import nltk
from nltk.tokenize.treebank import TreebankWordDetokenizer
import pythainlp

st.title('Word Cloud Generator')
st. markdown("""
Author: Thaweewat, 28/4/2022
""")
st.set_option('deprecation.showPyplotGlobalUse', False)
regexp = r"[ก-๙a-zA-Z']+"

test = 
"
“WEDO Young Talent Program” โครงการที่ตีความหมายใหม่ของคำว่า ‘เด็ก’ และ ‘ฝึกงาน’ โดยเริ่มจากการไม่มองว่าน้องเป็นเด็ก แต่คือ talent ยุคใหม่ที่มีศักยภาพในการเรียนรู้ และทำงานด้านนวัตกรรมได้เป็นอย่างดี น้องเลยได้ท้าทายกับโจทย์จริง ได้ลองของจริง เจ็บจริง พลาดจริง เพราะ WEDO เชื่อว่า Learning by Doing คือวิธีการที่ดีสุดในการสร้าง talent ยุคใหม่ และเพราะ Digital Economy คืออนาคตใหม่ของประเทศไทย ที่ต้องแข่งขันกันด้วยความคิดสร้างสรรค์ นวัตกรรม และเทคโนโลยี เพื่อสร้างมูลค่าเพิ่มทางเศรษฐกิจที่สูงขึ้น WEDO เห็นถึงความสำคัญเลยขอเป็นส่วนเล็ก ๆ ในการสร้าง talent ที่เหมาะกับระบบเศรษฐกิจใหม่แบบนี้ 

WEDO Young Talent Program จึงเป็นโปรแกรมการทำงานสิบสัปดาห์ที่ให้น้อง ๆ ได้สัมผัสประสบการณ์การทำโจทย์ทางธุรกิจแบบ Zero to One ในลักษณะการทำงานแบบ Micro Enterprise โดยมีพี่ ๆ ช่วย coach อยู่ห่าง ๆ เริ่มตั้งแต่การหา insights ไปจนกระทั่ง market fits ภายใต้ OKRs และเงื่อนเวลาที่ชัดเจนและท้าทาย

ตลอดทั้งโครงการ น้อง ๆ ได้พัฒนาความรู้และทักษะผ่านการเรียนการสอนอย่างเข้มข้นจากพี่ ๆ WEDO ผู้เชี่ยวชาญ ตั้งแต่การทำ Incubation Framework, Design Thinking ไปจนถึงการทำให้เกิด Lean Startup และ Pitching อีกทั้งยังได้เสริมทักษะทางด้าน Soft Skills อย่างความ DODEE (ดูดี) ในแบบ WEDO ที่ทั้งต้อง Mindset Dee, Skillset Dee, Contribution Dee รวมถึงได้เข้าฟัง Career Insight สุด exclusive ถึงประสบการณ์และเส้นทางสายอาชีพที่น่าสนใจจากพี่ ๆ WEDO โดยตรง



แชร์ประสบการณ์จากน้อง ๆ WEDO Young Talent


ฟลุ๊ค - ณัฐดนัย หล่อนิมิตดี นักศึกษาชั้นปีที่ 3 สาขาวิศวกรรมซอฟต์แวร์  คณะวิศวกรรมศาสตร์ มหาวิทยาลัยธรรมศาสตร์ เล่าว่า  จุดเริ่มต้นของการเข้าร่วมมาจากความสงสัยในตัวเอง จากการที่ตนนั้นชื่นชอบวิชาชีววิทยาเป็นอย่างมาก แต่ต่อมาได้เข้าศึกษาในสาขาวิศวกรรมซอฟต์แวร์ ดังนั้นจึงเกิดคำถามกับตัวเองมาโดยตลอดว่า จริง ๆ แล้วเราเหมาะกับสาขานี้จริงหรือ ?  และเพื่อต้องการหาข้อพิสูจน์สมมติฐานดังกล่าว ฟลุ๊คจึงได้เข้าร่วมกิจกรรมการแข่งขันต่าง ๆ มากมาย แต่สุดท้ายก็ได้พบกับความล้มเหลว เพราะ ความกล้ว 

ต่อมาได้เจอกับโครงการ WEDO Young Talent Program ซึ่ง ฟลุ๊คเลือกสมัคร เนื่องจาก สะดุดกับคำว่าทำงานจริง ซึ่งเขาต้องการก้าวข้ามข้อจำกัดต่าง ๆ ของตัวเอง จึงได้ลองดูอีกครั้ง ซึ่งก็ได้พบว่า สิ่งที่ได้จากโครงการนี้ ไม่ใช่แค่ความรู้และประสบการณ์ในการทำงานจริง แต่เป็น Mindset ของที่เปลี่ยนไปอย่างสิ้นเชิง

WEDO ทำให้เรากล้าที่จะยอมรับในสิ่งที่เราเป็น กล้าที่จะลองทำในสิ่งใหม่ ๆ กล้าที่จะออกจาก Comfort Zone ไม่ยึดติดกับความสำเร็จเดิม ๆ เปิดรับและเรียนรู้จากความล้มเหลว และก้าวต่อไปในเส้นทางของสายอาชีพวิศวกรซอฟต์แวร์ได้อย่างอย่างมั่นใจมากยิ่งขึ้นครับ  ฟลุ๊ค-ณัฐดนัย กล่าว



กาโต้ - ปณชัย วันขวัญ นักศึกษาชั้นปีที่ 3 สาขาคอมพิวเตอร์ คณะวิศวกรรมไฟฟ้าและคอมพิวเตอร์ มหาวิทยาลัยเทคโนโลยีพระจอมเกล้าพระนครเหนือ เล่าว่า การที่ได้เข้าร่วมโครงการ WEDO Young Talent นั้น ได้รับประสบการณ์ที่ดีมาก ๆ โดยได้เรียนได้เรียนรู้จากการทำงานจริง เจอความกดดันจริง ซึ่งเป็นสิ่งที่หาไม่ได้ภายในห้องเรียน และที่สำคัญได้ฝึกตนเองให้ทำงานร่วมกับผู้อื่น และสามารถนำมาประยุกต์ใช้ได้ในอนาคตอีกด้วย โดยระหว่างที่เข้าร่วมโครงการ ได้เรียนรู้กระบวนการสร้างนวัตกรรมและแผนธุรกิจ วิเคราะห์ความต้องการของลูกค้ากับผู้ใช้งานจริง มีการวิเคราะห์แผนธุรกิจผ่าน Business Framework ต่าง ๆ เช่น Value Proposition Canvas, Business Model Canvas และได้มีการพัฒนา prototype เพื่อเอาไปทดสอบด้วย

ตอนทำโปรเจกต์กลุ่มของผมได้หัวข้อที่ค่อนข้าง challenge คือ voice interface ซึ่งเราต้องพยายาม reframe การใช้เสียงให้อยู่ในรูปแบบใหม่ โดยทีมผมได้ออกแบบ platform เพื่อเป็นพื้นที่สำหรับคนที่อยากระบายความในใจ  ผมได้ล้มจริง เจ็บจริง จากการทำงานกับ WEDO และรู้สึกภูมิใจกับผลงานที่กลุ่มผมได้ทำมาก ซึ่งไม่มีทางได้มาจากการฝึกงานทั่วไปแน่นอนครับ กาโต้ -ปณชัย กล่าว 



บอย - ทวีวัฒน์ รักสุจริต นักศึกษาชั้นปีที่ 3 สาขาออกแบบสถาปัตยกรรมนานาชาติ คณะสถาปัตยกรรมศาสตร์ จุฬาลงกรณ์มหาวิทยาลัย เล่าว่า การมาฝึกงานที่ WEDO นั้น ไม่ได้เป็นการที่ให้นักศึกษาฝึกงานตามแผนกหรือ role แต่จะแบ่งเป็นกลุ่มเล็ก ๆ ประมาณ 3-4 คนต่อกลุ่ม หลังจากนั้นได้รับงานมาในรูปแบบ innoprise ที่ต้องนำเทคโนโลยีต่าง ๆ ไม่ว่าจะเป็น AR,NLP,BCI มาใช้แก้ปัญหาและทำออกมาเป็นโปรเจกต์คนวัตกรรมที่ไม่เพียงล้ำสมัย แต่ต้องตอบโจทย์และเป็นไปได้ทางธุรกิจด้วย เมื่อได้รับโจทย์มาก็จะต้องออกไปคุยกับลูกค้า เพื่อทำความเข้าใจ pain point ที่เกิดขึ้น และนำมาตีโจทย์ออกมาให้ชัดเจน ก่อนจะพัฒนาออกมาเป็นผลิตภัณฑ์ ซึ่งโจทย์ที่กลุ่มบอยได้รับเป็นเรื่อง Healthcare  ซึ่งก็ได้พัฒนาออกมาเป็น โปรแกรม HIS ที่แพทย์ใช้ในการอ่านข้อมูลคนไข้ เพื่อลดระยะเวลาในการตรวจรวมถึงลดข้อผิดพลาดที่อาจเกิดจากมนุษย์

หลังจากสิ้นสุดโครงการแล้ว บอย ก็ได้มาร่วมงานกับ WEDO ต่อในตำแหน่ง ML-Engineer 

ที่นี่มีสภาพการทำงานที่กึ่งสตาร์ทอัพ กับ enterprise ขนาดใหญ่ และมีงานหลากหลาย โดยการทำงานมีความ agile และเป็นกันเอง  ที่สำคัญที่สุดคือเป้าหมายของที่นี่ ที่ต้องการพัฒนา technology ของคนไทย เพื่อคนไทย ให้ก้าวกระโดดเทียบเท่าระดับนานาชาติ ซึ่งตรงกับ passion ของผมมาก ๆ  จึงตัดสินใจเข้ามาเป็นส่วนหนึ่งของการเดินทางนี้ครับ  บอย - ทวีวัฒน์ กล่าว

ผลงานไอเดียนวัตกรรมที่ไม่ธรรมดาของเหล่า Young Talent
นับว่าเป็นเวลากว่า 10 เดือนเต็ม กับโครงการ  WEDO Young Talent 2021 ที่ได้เฟ้นหาเด็กมีของแห่งอนาคต มาเรียนรู้โลกการทำงาน บ่มเพาะทักษะความเป็น T-Shape ที่รู้ลึกและรู้รอบทั้งด้าน Design, Business และ Technology  ซึ่งภารกิจสุดท้ายของโครงการก็คือ Pitching Day เป็น Online Pitching ที่ให้น้อง ๆ ผู้เข้าร่วมโครงการได้นำเสนอผลงาน พร้อมหาผู้ชนะในโครงการ โดยประกอบไปด้วยน้อง ๆ ทั้งหมด  13 ทีม รวมกว่า 40 คน ซึ่งผ่านการคัดเลือกมาจากผู้สมัครเข้าร่วมโครงการกว่า 700 คนทั่วประเทศ 

สำหรับกรรมการผู้ตัดสินในงาน Pitching Day ก็มีทั้งพี่ ๆจากบริษัท เอสซีจี ซิเมนต์-ผลิตภัณฑ์ก่อสร้าง จำกัด ได้แก่ คุณอาร์ท - อภิรัตน์ หวานชะเอม Chief Digital Officer คุณตั้ม - ธนุส ผะอบแสงHead of Digital Business Development และคุณโต-จิรพัฒน์ จันทร์เจิดศักดิ์, Innovation Management Director พร้อมทั้งมี Guest พิเศษ อย่าง คุณมิหมี - อรนุช เลิศสุวรรณกิจ CEO และ Co-Founder ของ Techsauce เข้าร่วมเป็น mentor ให้กับน้อง ๆ ด้วย 

ผลงานของน้อง ๆ ทั้ง 13 ทีมมีดังนี้ 
ทีมที่ 1 เพื่อนรู้ใจ แอปพลิเคชั่นที่ให้เรามีเพื่อนเป็น AI ที่จะทำให้เรามีเพื่อนไว้พูดคุยในยามไม่สบายใจได้ โดยใช้เทคโนโลยี Computer Vision ซึ่งในแอปมีฟีเจอร์ที่หลากหลายให้เราสามารถสนทนา ระบายอารมณ์ บันทึกอารมณ์ รวมถึงสร้างสัตว์เลี้ยงเสมือนเป็นเพื่อนเราได้ด้วย

ทีมที่ 2  We Health - health service platform ที่ให้บริการด้านสุขภาพโดยมีระบบ telemedicine และ Doctor AI คอยให้คำแนะนำ และวินิจัยโรคเบื้องต้นได้   นอกจากนี้ยังมีการต่อยอดสู่ We health box ที่สามารถให้บริการในระดับท้องถิ่นและตอบโจทย์สำหรับผู้ที่ต้องการหาหมอแต่ใช้สมาร์ทโฟนไม่คล่องแคล่ว หลังจากนั้นสามารถรับยาผ่านตู้  We Pharmacy ได้

ทีมที่ 3 CarHub กล่องพัสดุที่ยับยั้งเชื้อโรคได้ โดยกล่องนี้จะเคลือบสารสกัด ที่ทำมาจาก Food Waste อย่างเปลือกกุ้ง นำมาสกัดเป็นสารที่นำไปเคลือบบนพื้นผิวกล่องยับยั้งการเจริญเติบโตของแบคทีเรียและไวรัสได้

ทีมที่ 4 HIDETECT แอปช่วยตรวจจับข้อความ Cyber Bully ด้วยเทคโนโลยี NLP (Natural Language Processing) กดติ้งตั้ง แล้วจะช่วยซ่อนข้อความไม่ดีให้หายไป อีกทั้งยังสามารถเปลี่ยนข้อความไม่ดี ให้เป็นข้อความที่ดีได้ ช่วยเตรียมพร้อมให้ผู้ใช้เข้มแข็ง และลดอัตราผู้ป่วยโรคซึมเศร้า

ทีมที่  5  Nash ห้องเรียนแห่งอนาคต Play & Learn Room ทลายกรอบของห้องเรียนสี่เหลี่ยมด้วยการสร้าง Interactive Display ด้วยเทคโนโลยี AR VR พร้อมมี AI เข้ามาช่วยครูสอนนักเรียน กระตุ้นการเรียนการสอนให้สนุกยิ่งขึ้น 

ทีมที่ 6 หมอกระเป๋า อุปกรณ์ช่วยอสม. วินิจฉัยโรค ติดตามอาการ ดูแลชาวบ้านในพื้นที่ห่างไกลสถานพยาบาลได้  ด้วยเทคโนโลยี Edge AI ใช้ทำงานที่ไหนก็ได้ แม้ไม่มีสัญญาณอินเทอร์เน็ต 

ทีมที่ 7 Mailbox แอปพลิเคชั่นสร้างพื้นที่ปลอดภัยในยามไม่สบายใจ โดยช่วย Matching คนที่อยากจะระบาย และคนที่อยากจะรับฟังให้มาเจอกัน จับความรู้สึกกับเสียงที่พูดด้วยเทคโนโลยี Voice Interface 

ทีมที่ 8 BocBox the smart post office ตู้บริการไปรณีย์อัตโนมัติ ที่ผู้ใช้สามารถใช้ได้ตั้งแต่บรรจุพัสดุลงกล่อง จนส่งของให้กับผู้บริการขนส่ง โดยไม่ต้องใช้คนแม้แต่ขั้นตอนเดียว 

ทีมที่ 9 AVA Smart Mirror กระจกอัจฉริยะที่จะทำหน้าที่เป็นทั้งผู้ช่วย และเพื่อนสนิท จากการเก็บข้อมูลของเรา จะจดจำ และบอกการเปลี่ยนแปลง รวมถึงแนะนำผลิตภัณฑ์ต่างๆ ที่ควรใช้ได้

ทีมที่ 10 My Mind ชุดอุปกรณ์  BCI (Brain Computer Interface) ติดต่อโดยตรงระหว่างคลื่นสมองกับหน้าจอ ช่วยดูแลผู้ป่วยติดเตียง อำนวยความสะดวกให้คนดูแลผู้ป่วยที่ไม่สามารถช่วยเหลือตัวเองและบอกความต้องการได้ 

ทีมที่ 11 HISTIA บริการ Saas (Software as a service) สำหรับสถานพยาบาล ช่วยแพทย์ให้ทำงานง่ายขึ้น  ด้วยการใช้  Machine Learning มาเรียนรู้การทำงานผ่านจอคอมพิวเตอร์ของแพทย์ และจะแนะนำฟีเจอร์และจัดเรียง User Interface ให้ใช้งานง่ายขึ้น

ทีมที่ 12 EX-Box กล่องโฆษณาระบบ IOT ที่ประสานออนไลน์ - ออฟไลฟ์เข้าด้วยกัน ที่สามารถสร้างประสบการณ์ให้ลูกค้าได้มากกว่า  ด้วยเทคโนโลยี AR ที่ช่วยสร้างโลกเสมือนจริง พร้อมทดลองสินค้าผ่านระบบโฮโลแกรม 

ทีมที่ 13 อุปกรณ์ Smart Tracker กล่องไทเทเนียมหุ้มด้วยซิลิโคน ติดตั้งบนรถ ที่ช่วยติดตามข้อมูลการเกิดอุบัติเหตุ  แบบเรียลไทม์ ส่งข้อมูลหาสายด่วนทักที เพื่อส่งรถพยาบาลมาให้เร็วที่สุด เพิ่มความปลอดภัยให้กับผู้ใช้ได้

สรุปผลการตัดสิน Pitching Day เป็นดังนี้ 
รางวัลชนะเลิศ อันดับ 1 ได้แก่ ทีมที่ 10 My Mind ชุดอุปกรณ์  BCI ช่วยดูแลผู้ป่วยติดเตียง

อันดับที่ 2 ได้แก่ ทีมที่ 4 HIDETECT แอปช่วยตรวจจับข้อความ Cyber Bully ด้วยเทคโนโลยี NLP

อันดับที่ 3 ได้แก่ ทีมที่ 11  HISTIA บริการ Saas สำหรับสถานพยาบาล ช่วยแพทย์ทำงานง่ายขึ้น  ด้วยเทคโนโลยี ML 

อันดับที่ 4 ได้แก่ ทีมที่ 6 หมอกระเป๋า อุปกรณ์ช่วยอสม. ดูแลชาวบ้านในพื้นที่ห่างไกล ด้วยเทคโนโลยี Edge AI

และอันดับที่ 5 ได้แก่ ทีมที่ 12 EX-Box กล่องโฆษณาระบบ IOT ที่ประสานออนไลน์ - ออฟไลฟ์เข้าด้วยกัน

นอกจากนี้ยังมีรางวัลพิเศษอีก 3 รางวัล ดังนี้ The Most Compelling Storytelling Award ได้แก่ ทีมที่ 10 กับโปรเจ็กต์ My Mind  อีกทั้งยังคว้าอีกหนึ่งรางวัล คือ Challenge Status Quo Award กล้าท้าทายขีดจำกัดเดิม ไปอีกด้วย

และอีกหนึ่งรางวัล คือ AHA Moment Award ภาพรวมโปรเจกต์ว้าว ซึ่งทีมที่ 12 EX-Box กล่องโฆษณาระบบ IOT ได้รับรางวัลไปครอง
"


# Create some sample text
token = st.text_input('Text :', test)
Text = word_tokenize(token, keep_whitespace=False)
Text = TreebankWordDetokenizer().detokenize(Text)

st.sidebar.header("Select No. of words you want to display")
words = st.slider('Set maximum charactor: ', 10, 5000, 200)
st.write("Maximum words: ", words, 'Characters')


wordcloud = WordCloud(background_color = "white"
                      , max_words = words
                      , width=2000
                      , height=2000
                      , relative_scaling = 0.3
                      , colormap='plasma'
                      , collocations=False
                      , regexp=regexp
                      , margin=2
                      , font_path ='Kanit-Regular.ttf').generate(Text)


# Display the generated image:
plt.imshow(wordcloud, interpolation='bilinear')
plt.axis("off")
plt.show()
st.pyplot()
